Tekla.Structures.Catalogs.MeshItem
The MeshItem class contains information from the meshes in the catalog
(mesh_database.inp).

Tekla.Structures.Catalogs.MeshItem.#ctor
Creates a new mesh item instance.

Tekla.Structures.Catalogs.MeshItem.Grade
The mesh item's grade.

Tekla.Structures.Catalogs.MeshItem.Name
The mesh item's name.

Tekla.Structures.Catalogs.MeshItem.DiameterLongitudinal
The mesh item's longitudinal direction bar size.

Tekla.Structures.Catalogs.MeshItem.DistanceLongitudinal
The mesh item's longitudinal direction distance.

Tekla.Structures.Catalogs.MeshItem.Length
The mesh item's length.

Tekla.Structures.Catalogs.MeshItem.MinimumOverlappingLongitudinal
The mesh item's longitudinal direction minimum overlapping.

Tekla.Structures.Catalogs.MeshItem.MaximumOverlappingLongitudinal
The mesh item's longitudinal direction maximum overlapping.

Tekla.Structures.Catalogs.MeshItem.LeftOverhangLongitudinal
The mesh item's longitudinal direction left overhang.

Tekla.Structures.Catalogs.MeshItem.RightOverhangLongitudinal
The mesh item's longitudinal direction right overhang.

Tekla.Structures.Catalogs.MeshItem.DiameterCross
The mesh item's cross direction bar size.

Tekla.Structures.Catalogs.MeshItem.DistanceCross
The mesh item's cross direction distance.

Tekla.Structures.Catalogs.MeshItem.Width
The mesh item's width.

Tekla.Structures.Catalogs.MeshItem.MinimumOverlappingCross
The mesh item's cross direction minimum overlapping.

Tekla.Structures.Catalogs.MeshItem.MaximumOverlappingCross
The mesh item's cross direction maximum overlapping.

Tekla.Structures.Catalogs.MeshItem.LeftOverhangCross
The mesh item's cross direction left overhang.

Tekla.Structures.Catalogs.MeshItem.RightOverhangCross
The mesh item's cross direction right overhang.

Tekla.Structures.Catalogs.MeshItem.Select(System.String,System.String)
Selects the mesh item in the mesh database.
MeshName: The name of the mesh item to select.
MeshGrade: The grade of the mesh item to select.
Returns: True on success.

Tekla.Structures.Catalogs.MeshItem.Export(System.String@)
Exports the rebar item in the catlog to given file name.
If path is not given rebar is exported to model folder.
If filename is empty rebar name is used as filename.
using System;
using Tekla.Structures.Catalogs;
public class Example
{
public void Example1()
{
RebarItem item = new RebarItem();
if (item.Select("A500HW", "10", RebarItem.MAIN_USAGE))
{
string filename = System.IO.Path.GetTempPath() + "\\" + "A500HW_10_MAIN";
if (item.Export(ref filename))
{
Console.WriteLine("A500HW exported successfully");
}
}
}
}
filename: The export file name of the item.
Returns: True on success.